In [1]:
import pandas as pd

In [2]:
info_df=pd.DataFrame({'age':[30,25,25,12,40],
                     'height':[178,180,160,140,176],
                     'weight':[80,100,55,40,70]})

In [3]:
info_df

   age  height  weight
0   30     178      80
1   25     180     100
2   25     160      55
3   12     140      40
4   40     176      70

In [4]:
f_range=lambda x:x.max()-x.min()
info_df.apply(f_range)

age       28
height    40
weight    60
dtype: int64

In [5]:
info_df.apply(f_range,axis=1)

0    148
1    155
2    135
3    128
4    136
dtype: int64

In [6]:
info_df.apply(f_range,axis=0)

age       28
height    40
weight    60
dtype: int64

In [7]:
info_df.applymap(lambda x:-x)

   age  height  weight
0  -30    -178     -80
1  -25    -180    -100
2  -25    -160     -55
3  -12    -140     -40
4  -40    -176     -70

In [8]:
iris_df=pd.read_csv('iris.csv')

In [10]:
iris_df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [13]:
iris_mat=iris_df.values

In [14]:
iris_mat[:4,:]

array([[1, 5.1, 3.5, 1.4, 0.2, 'Iris-setosa'],
       [2, 4.9, 3.0, 1.4, 0.2, 'Iris-setosa'],
       [3, 4.7, 3.2, 1.3, 0.2, 'Iris-setosa'],
       [4, 4.6, 3.1, 1.5, 0.2, 'Iris-setosa']], dtype=object)

In [16]:
iris_mat.shape

(150, 6)

In [17]:
iris_mat.ndim

2

In [18]:
iris_mat.size

900

In [20]:
iris_df['Species'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [22]:
iris_df.mean()

Id               75.500000
SepalLengthCm     5.843333
SepalWidthCm      3.054000
PetalLengthCm     3.758667
PetalWidthCm      1.198667
dtype: float64

In [24]:
iris_df.corr()# 상관계수 -1 ~ 1사이 범위, 1에 가까울수록 비례, -1에 가까울수록 반비례

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm
Id,1.000000,0.716676,-0.397729,0.882747,0.899759
SepalLengthCm,0.716676,1.000000,-0.109369,0.871754,0.817954
SepalWidthCm,-0.397729,-0.109369,1.000000,-0.420516,-0.356544
PetalLengthCm,0.882747,0.871754,-0.420516,1.000000,0.962757
PetalWidthCm,0.899759,0.817954,-0.356544,0.962757,1.000000

In [27]:
iris_df.sort_values('SepalLengthCm',ascending=False).head(3)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
131,132,7.9,3.8,6.4,2.0,Iris-virginica
135,136,7.7,3.0,6.1,2.3,Iris-virginica
122,123,7.7,2.8,6.7,2.0,Iris-virginica

In [28]:
iris_df.sort_values(['SepalLengthCm','PetalLengthCm'],ascending=False).head(3)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
131,132,7.9,3.8,6.4,2.0,Iris-virginica
118,119,7.7,2.6,6.9,2.3,Iris-virginica
117,118,7.7,3.8,6.7,2.2,Iris-virginica

In [32]:
iris_df.isnull().head(5)

      Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm  Species
0  False          False         False          False         False    False
1  False          False         False          False         False    False
2  False          False         False          False         False    False
3  False          False         False          False         False    False
4  False          False          True          False         False    False

In [31]:
iris_df=pd.read_csv('iris.csv')

In [33]:
iris_df.isnull().sum()

Id               0
SepalLengthCm    1
SepalWidthCm     2
PetalLengthCm    2
PetalWidthCm     1
Species          0
dtype: int64

In [37]:
iris_df.dropna()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
5,6,5.4,3.9,1.7,0.4,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [38]:
iris_df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,NaN,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

### 피벗테이블과 그룹분석

In [41]:
df1=pd.DataFrame({'도시':['서울','서울','서울','부산','부산','부산','인천','인천'],
                  '연도':['2020','2015','2010','2020','2015','2010','2020','2015'],
                  '인구':[9904332,9631487,9762553,3448726,3393194,3512548,2890444,263223],
                  '지역':['수도권','수도권','수도권','경상권','경상권','경상권','수도권','수도권']})

In [42]:
df1

   도시    연도       인구   지역
0  서울  2020  9904332  수도권
1  서울  2015  9631487  수도권
2  서울  2010  9762553  수도권
3  부산  2020  3448726  경상권
4  부산  2015  3393194  경상권
5  부산  2010  3512548  경상권
6  인천  2020  2890444  수도권
7  인천  2015   263223  수도권

In [44]:
df1.pivot('도시','연도','인구')

연도       2010       2015       2020
도시
부산  3512548.0  3393194.0  3448726.0
서울  9762553.0  9631487.0  9904332.0
인천        NaN   263223.0  2890444.0

In [45]:
df1.set_index(['도시','연도'])[['인구']].unstack()

           인구
연도       2010       2015       2020
도시
부산  3512548.0  3393194.0  3448726.0
서울  9762553.0  9631487.0  9904332.0
인천        NaN   263223.0  2890444.0

### 그룹분석

In [47]:
df2=pd.DataFrame({'key1':['A','A','B','B','A'],
                 'key2':['small','big','small','big','small'],
                 'var1':[1,3,6,9,15],
                 'var2':[100,120,150,180,200]})
df2

  key1   key2  var1  var2
0    A  small     1   100
1    A    big     3   120
2    B  small     6   150
3    B    big     9   180
4    A  small    15   200

In [49]:
df2.groupby('key1')['var1'].mean()

key1
A    6.333333
B    7.500000
Name: var1, dtype: float64

### 붓꽃(iris)데이터

In [50]:
import seaborn as sns
iris=sns.load_dataset('iris')

In [51]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [54]:
def q3cut(s):
    return pd.qcut(s,3,labels=["소","중","대"]).astype(str)

iris['petal_lenght_class']=iris.groupby('species')['petal_length'].transform(q3cut)
iris.head(10)

,sepal_length,sepal_width,petal_length,petal_width,species,petal_lenght_class
0,5.1,3.5,1.4,0.2,setosa,소
1,4.9,3.0,1.4,0.2,setosa,소
2,4.7,3.2,1.3,0.2,setosa,소
3,4.6,3.1,1.5,0.2,setosa,중
4,5.0,3.6,1.4,0.2,setosa,소
5,5.4,3.9,1.7,0.4,setosa,대
6,4.6,3.4,1.4,0.3,setosa,소
7,5.0,3.4,1.5,0.2,setosa,중
8,4.4,2.9,1.4,0.2,setosa,소
9,4.9,3.1,1.5,0.1,setosa,중

### 시계열 데이터

In [57]:
date_str=['2020, 1, 1',
         '2020, 1, 2',
         '2020, 1, 6',
         '2020, 1, 8']
idx=pd.to_datetime(date_str)
idx

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-06', '2020-01-08'], dtype='datetime64[ns]', freq=None)

In [60]:
import numpy as np
np.random.seed(0)
s=pd.Series(np.random.randn(4),index=idx)
s

2020-01-01    1.764052
2020-01-02    0.400157
2020-01-06    0.978738
2020-01-08    2.240893
dtype: float64

In [61]:
pd.date_range('2020-1-1','2020-1-30')

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10', '2020-01-11', '2020-01-12',
               '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-18', '2020-01-19', '2020-01-20',
               '2020-01-21', '2020-01-22', '2020-01-23', '2020-01-24',
               '2020-01-25', '2020-01-26', '2020-01-27', '2020-01-28',
               '2020-01-29', '2020-01-30'],
              dtype='datetime64[ns]', freq='D')

In [65]:
pd.date_range('2020-1-1',periods=30,freq='B')

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-06',
               '2020-01-07', '2020-01-08', '2020-01-09', '2020-01-10',
               '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-20', '2020-01-21', '2020-01-22',
               '2020-01-23', '2020-01-24', '2020-01-27', '2020-01-28',
               '2020-01-29', '2020-01-30', '2020-01-31', '2020-02-03',
               '2020-02-04', '2020-02-05', '2020-02-06', '2020-02-07',
               '2020-02-10', '2020-02-11'],
              dtype='datetime64[ns]', freq='B')

In [66]:
s=pd.Series(pd.date_range('2020-12-25',periods=100,freq='D'))
s

0    2020-12-25
1    2020-12-26
2    2020-12-27
3    2020-12-28
4    2020-12-29
        ...
95   2021-03-30
96   2021-03-31
97   2021-04-01
98   2021-04-02
99   2021-04-03
Length: 100, dtype: datetime64[ns]

In [72]:
s.dt.weekday

0     4
1     5
2     6
3     0
4     1
     ..
95    1
96    2
97    3
98    4
99    5
Length: 100, dtype: int64

In [73]:
s.dt.strftime('%Y년 %m월 %d일')

0     2020년 12월 25일
1     2020년 12월 26일
2     2020년 12월 27일
3     2020년 12월 28일
4     2020년 12월 29일
          ...
95    2021년 03월 30일
96    2021년 03월 31일
97    2021년 04월 01일
98    2021년 04월 02일
99    2021년 04월 03일
Length: 100, dtype: object